STMicroelectronics/STM32CubeWBA/Projects/STM32WBA55G-DK1/Applications/BLE/BLE_Audio_TMAP_Central/STM32_WPAN/App/tmap_app.h
#endif /* (APP_MCP_ROLE_SERVER_SUPPORT == 1u) */

/*Structure used for connection information strorage*/
typedef struct
{
  uint16_t                  Acl_Conn_Handle;
  uint8_t                   Peer_Address_Type;
  uint8_t                   Peer_Address[6];
  uint8_t                   Role;
  audio_profile_t           AudioProfile;
  uint8_t                   ConfirmIndicationRequired;
  uint8_t                   ForceCompleteLinkup;
  APP_ASEs_t                *pASEs;
  uint8_t                   CSIPDiscovered; /*Set to 1 if Set Member has been discovered (but not yet CAP linked)*/
  uint8_t                   SIRK_type;
  uint8_t                   SIRK[16];
  uint8_t                   Rank;
  uint8_t                   Size;
  BAP_Unicast_Server_Info_t UnicastServerInfo;
  uint8_t                   TargetedMediaQoSConfSupported;
  uint8_t                   TargetedTelephonySrcQoSConfSupported;
  uint8_t                   TargetedTelephonySnkQoSConfSupported;
}APP_ACL_Conn_t;

typedef struct
{
  BAP_Role_t                    bap_role;

  APP_ACL_Conn_t                ACL_Conn[CFG_BLE_NUM_LINK];

  uint8_t                       audio_driver_config;

  Audio_Role_t                  audio_role_setup;

  uint16_t                      cis_src_handle[APP_MAX_NUM_CIS];

  uint8_t                       num_cis_src;

  uint16_t                      cis_snk_handle[APP_MAX_NUM_CIS];

  uint8_t                       num_cis_snk;

  uint16_t                      cis_handle[APP_MAX_NUM_CIS];

  uint8_t                       num_cis_established;

  Sampling_Freq_t               ConfiguredSampleFrequency;

  BAP_AudioCodecController_t    AudioCodecInController;

  BAP_SupportedStandardCodec_t  aStandardCodec[1];

  APP_ASEs_t                    aASEs[CFG_BLE_NUM_LINK];

  uint8_t                       NumOutputChannels;

#if (APP_CCP_ROLE_SERVER_SUPPORT == 1u)
  TMAPAPP_Bearer_t              GenericBearer;
#if (APP_CCP_NUM_LOCAL_BEARER_INSTANCES > 0u)
  TMAPAPP_Bearer_t              BearerInstance[APP_CCP_NUM_LOCAL_BEARER_INSTANCES];
#endif /*(APP_CCP_NUM_LOCAL_BEARER_INSTANCES > 0u)*/

  uint8_t                       CurrentCallID;
#endif /* (APP_CCP_ROLE_SERVER_SUPPORT == 1u) */

#if (APP_MCP_ROLE_SERVER_SUPPORT == 1u)
  TMAPAPP_MediaPlayer_t         GenericMediaPlayer;
#if (APP_MCP_NUM_LOCAL_MEDIA_PLAYER_INSTANCES > 0u)
  TMAPAPP_MediaPlayer_t         MediaPlayerInstance[APP_MCP_NUM_LOCAL_MEDIA_PLAYER_INSTANCES];
#endif /*(APP_MCP_NUM_LOCAL_MEDIA_PLAYER_INSTANCES > 0u)*/

#endif /* (APP_CCP_ROLE_SERVER_SUPPORT == 1u) */

  uint8_t                       SetMemberDiscoveryProcActive;

  /* Broadcast context */
  BAP_BASE_Group_t              BaseGroup;
  BAP_BASE_Subgroup_t           BaseSubgroups[APP_MAX_SUBGROUPS];
  BAP_BASE_BIS_t                BaseBIS[APP_MAX_NUM_BIS];
  uint8_t                       BISCodecSpecificConfig[APP_MAX_NUM_BIS][MAX_BIS_CODEC_CONFIG_LEN];
  uint8_t                       SubgroupCodecSpecificConfig[APP_MAX_SUBGROUPS][APP_MAX_SUBGROUP_CODEC_CONFIG_LEN];
  uint8_t                       SubgroupMetadata[APP_MAX_SUBGROUPS][MAX_BSRC_METADATA_LEN];
  uint8_t                       RTN;
  uint16_t                      MaxTransportLatency;
  uint16_t                      CurrentBISConnHandle[APP_MAX_NUM_BIS];
  uint8_t                       CurrentNumBIS;
} TMAPAPP_Context_t;

typedef struct
{
  Sampling_Freq_t               freq;
  Frame_Duration_t              frame_duration;
  uint16_t                      octets_per_codec_frame;
} APP_CodecConf_t;

typedef struct
{
  Sampling_Freq_t               freq;
  uint32_t                      sdu_interval;
  BAP_Framing_t                 framing;
  uint16_t                      max_sdu;
  uint8_t                       rtx_num;
  uint16_t                      max_tp_latency;
  uint32_t                      presentation_delay;
} APP_QoSConf_t;

typedef struct
{
  uint8_t                       NumSnkASEs;
  uint8_t                       NumSrcASEs;
  uint8_t                       NumAudioChnlsPerSnkASE;
  uint8_t                       MinSnkAudioLocations;
  uint8_t                       NumAudioChnlsPerSrcASE;
  uint8_t                       MinSrcAudioLocations;
  uint8_t                       NumCISes;
  uint16_t                      NumAudioStreams;
} APP_UnicastAudioConf_t;

/* External variables --------------------------------------------------------*/

/* Exported macros ------------------------------------------------------------*/

/* Exported functions ---------------------------------------------*/
tBleStatus APP_AUDIO_STACK_Init(void);
void TMAPAPP_Init(void);
tBleStatus TMAPAPP_Linkup(uint16_t ConnHandle);
uint8_t TMAPAPP_StartScanning(void);
uint8_t TMAPAPP_StopScanning(void);
uint8_t TMAPAPP_CreateConnection(uint8_t *pAddress, uint8_t AddressType);
uint8_t TMAPAPP_RemoteVolumeUp(void);
uint8_t TMAPAPP_RemoteVolumeDown(void);
uint8_t TMAPAPP_RemoteToggleMute(void);
void TMAPAPP_LocalVolumeUp(void);
void TMAPAPP_LocalVolumeDown(void);
void TMAPAPP_LocalToggleMute(void);
tBleStatus TMAPAPP_NextTrack(void);
tBleStatus TMAPAPP_PreviousTrack(void);
tBleStatus TMAPAPP_PlayPause(void);
tBleStatus TMAPAPP_AnswerCall(void);
tBleStatus TMAPAPP_TerminateCall(void);
tBleStatus TMAPAPP_IncomingCall(void);
uint8_t TMAPAPP_StartMediaStream(void);
uint8_t TMAPAPP_StartTelephonyStream(void);
uint8_t TMAPAPP_StopStream(void);
tBleStatus TMAPAPP_StartBroadcastSource(uint8_t BAPConfID);
tBleStatus TMAPAPP_StopBroadcastSource(void);
uint8_t TMAPAPP_Disconnect(void);
void TMAPAPP_AclConnected(uint16_t Conn_Handle,uint8_t Peer_Address_Type,uint8_t Peer_Address[6],uint8_t role);
void TMAPAPP_CISConnected(uint16_t Conn_Handle);
void TMAPAPP_LinkDisconnected(uint16_t Conn_Handle,uint8_t Reason);
void TMAPAPP_ConfirmIndicationRequired(uint16_t Conn_Handle);
void TMAPAPP_BondLost(uint16_t Conn_Handle);
void TMAPAPP_ClearDatabase(void);
#ifdef __cplusplus
}
#endif

#endif /*__TMAP_APP_H */
